Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 480, 480, 1)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 480, 480, 2)  20          input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 160, 160, 2)  0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 160, 160, 2)  0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 160, 160, 4)  76          dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 160, 160, 4)  76          dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 160, 160, 4)  148         conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 160, 160, 4)  76          dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 160, 160, 4)  148         conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 160, 160, 4)  148         conv2d_6[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 160, 160, 12) 0           conv2d_2[0][0]                   
                                                                 conv2d_4[0][0]                   
                                                                 conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 53, 53, 12)   0           concatenate_1[0][0]              
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 53, 53, 12)   0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 53, 53, 24)   2616        dropout_2[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 17, 17, 24)   0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 17, 17, 24)   0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 17, 17, 48)   10416       dropout_3[0][0]                  
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 17, 17, 48)   10416       dropout_3[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 17, 17, 48)   20784       conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 17, 17, 48)   10416       dropout_3[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 17, 17, 48)   20784       conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 17, 17, 48)   20784       conv2d_13[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 17, 17, 144)  0           conv2d_9[0][0]                   
                                                                 conv2d_11[0][0]                  
                                                                 conv2d_14[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 5, 5, 144)    0           concatenate_2[0][0]              
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 5, 5, 144)    0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 5, 5, 288)    373536      dropout_4[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 1, 1, 288)    0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 1, 1, 288)    0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 288)          0           dropout_5[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 100)          28900       flatten_1[0][0]                  
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 100)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           1010        dropout_6[0][0]                  
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 10)           0           dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 2)            22          dropout_7[0][0]                  
==================================================================================================
Total params: 500,376
Trainable params: 500,376
Non-trainable params: 0
__________________________________________________________________________________________________
